"use strict";

//lesson 3


//задание - 1
//1. Написать функцию, преобразующую число в объект. Передавая на вход число от 0 до 999, мы должны получить на выходе объект, в котором в соответствующих свойствах описаны единицы, десятки и сотни. Например, для числа 245 мы должны получить следующий объект: {‘единицы’: 5, ‘десятки’: 4, ‘сотни’: 2}. Если число превышает 999, необходимо выдать соответствующее сообщение с помощью console.log и вернуть пустой объект.
console.log(' задание 1 ');


//2. Для игры, реализованной на уроке, добавить возможность вывода хода номер n (номер задается пользователем)
//console.log(' задание 2 ');

//3. *На базе игры, созданной на уроке, реализовать игру «Кто хочет стать миллионером?»
//console.log(' задание 3 ');